import random, sympy, sys
import colorlabels as cl


def gcd(a: int, b: int) -> int:
    while a != b:
        if a > b:
            a = a - b
        else:
            b = b - a
    return a


def Test_Ferma(n: int) -> bool:
    for i in range(100):
        g = random.randint(2, n - 1)
        if pow(g, n - 1, n) != 1:
            return False
    return True


def Test_SSt(n: int) -> bool:
    for i in range(100):
        a = random.randint(2, n - 1)
        g = ((n - 1) // 2)
        r = pow(a, g, n)

        if gcd(a, n) > 1:
            return False

        if r != 1 and r != n - 1:
            return False

        if r % n != sympy.jacobi_symbol(a, n) % n:
            return False

    return True-


def Test_MR(n: int) -> bool:
    r, s = 0, n - 1
    while s % 2 == 0:
        r += 1
        s //= 2
    for _ in range(100):
        a = random.randrange(2, n - 1)
        x = pow(a, s, n)
        if x == 1 or x == n - 1:
            continue
        for _ in range(r - 1):
            x = pow(x, 2, n)
            if x == n - 1:
                break
        else:
            return False
    return True


# def Tests(n: int) -> str:
#     if Test_Ferma(n) == False: return f"{cl.RED}Число {cl.WHITE}{n} {cl.RED}составное (по тесту Ферма)"
#     if Test_SSt(n) == False: return f"{cl.RED}Число {cl.WHITE}{n} {cl.RED}составное (по тесту Соловэя-Штрассена)"
#     if Test_MR(n) == False: return f"{cl.RED}Число {cl.WHITE}{n} {cl.RED}составное (по тесту Миллера-Рабина)"
#     return f"{cl.GREEN}Число {cl.WHITE}{n}{cl.GREEN} с большой вероятностью {cl.WHITE}{'простое'.upper()}"

def Tests(n):
    if Test_Ferma(n) == False: print(f"{cl.RED}Число {cl.WHITE}{n} {cl.RED}составное (по тесту Ферма)")
    else: print(f"{cl.GREEN}Число {cl.WHITE}{n}{cl.GREEN} с большой вероятностью {cl.WHITE}{'простое'.upper()}")
    if Test_SSt(n) == False: print(f"{cl.RED}Число {cl.WHITE}{n} {cl.RED}составное (по тесту Соловэя-Штрассена)")
    else: print(f"{cl.GREEN}Число {cl.WHITE}{n}{cl.GREEN} с большой вероятностью {cl.WHITE}{'простое'.upper()}")
    if Test_MR(n) == False: print(f"{cl.RED}Число {cl.WHITE}{n} {cl.RED}составное (по тесту Миллера-Рабина)")
    else: print(f"{cl.GREEN}Число {cl.WHITE}{n}{cl.GREEN} с большой вероятностью {cl.WHITE}{'простое'.upper()}")


# num = int(sys.argv[1])
num = [3229, 3251, 3253, 3257, 3259, 3271, 3299, 3301, 3307, 3313, 3319, 3323, 3329, 3331, 3343, 3347, 3359, 3361, 3371, 3373, 3389, 3391, 3407, 3413, 3433, 3449, 3457, 3461, 3463, 3467, 3469, 3491, 3499, 3511, 3517, 3527, 3529, 3533, 3539, 3541, 3547, 3557, 3559, 3571, 3581, 3583, 3593, 3607, 3613, 3617, 3623, 3631, 3637, 3643, 3659, 3671, 3673, 3677, 3691, 3697, 3701, 3709, 3719, 3727, 3733, 3739, 3761, 3767, 3769, 3779, 3793, 3797, 3803, 3821, 3823, 3833, 3847, 3851, 3853, 3863, 3877, 3881, 3889, 3907, 3911, 3917, 3919, 3923, 3929, 3931, 3943, 3947, 3967, 3989, 4001, 4003, 4007, 4013, 4019, 4021, 4027, 4049, 4051, 4057, 4073, 4079, 4091, 4093, 4099, 4111, 4127, 4129, 4133, 4139, 4153, 4157, 4159, 4177, 4201, 4211, 4217, 4219, 4229, 4231, 4241, 4243, 4253, 4259, 4261, 4271, 4273, 4283, 4289, 4297, 4327, 4337, 4339, 4349, 4357, 4363, 4373, 4391, 4397, 4409, 4421, 4423, 4441, 4447, 4451, 4457, 4463, 4481, 4483, 4493, 4507, 4513, 4517, 4519, 4523, 4547, 4549, 4561, 4567, 4583, 4591, 4597, 4603, 4621, 4637]
num2 = [8369, 8377, 8387, 8389, 8419, 8423, 8429, 8431, 8443, 8447, 8461, 8467, 8501, 8513, 8521, 8527, 8537, 8539, 8543, 8563, 8573, 8581, 8597, 8599, 8609, 8623, 8627, 8629, 8641, 8647, 8663, 8669, 8677, 8681, 8689, 8693, 8699, 8707, 8713, 8719, 8731, 8737, 8741, 8747, 8753, 8761, 8779, 8783, 8803, 8807, 8819, 8821, 8831, 8837, 8839, 8849, 8861, 8863, 8867, 8887, 8893, 8923, 8929, 8933, 8941, 8951, 8963, 8969, 8971, 8999, 9001, 9007, 9011, 9013, 9029, 9041, 9043, 9049, 9059, 9067, 9091, 9103, 9109, 9127, 9133, 9137, 9151, 9157, 9161, 9173, 9181, 9187, 9199, 9203, 9209, 9221, 9227, 9239, 9241, 9257, 9277, 9281, 9283, 9293, 9311, 9319, 9323, 9337, 9341, 9343, 9349, 9371, 9377, 9391, 9397, 9403, 9413, 9419, 9421, 9431, 9433, 9437, 9439, 9461, 9463, 9467, 9473, 9479, 9491, 9497, 9511, 9521, 9533, 9539, 9547, 9551, 9587, 9601, 9613, 9619, 9623, 9629, 9631, 9643, 9649, 9661, 9677, 9679, 9689, 9697, 9719, 9721, 9733, 9739, 9743, 9749, 9767, 9769, 9781, 9787, 9791, 9803, 9811, 9817, 9829, 9833, 9839, 9851, 9857, 9859, 9871, 9883, 9887, 9901, 9907, 9923, 9929, 9931, 9941, 9949, 9967, 9973, 10007, 10009, 10037, 10039]
num3 = [4579 for i in range(300)]
num4 = [1105 for i in range(1000)]
for i in num4:
    print(f'{cl.BRIGHT_CYAN}{i}')
    Tests(i)

